[
    {
        "date": "04/18/2024",
        "name": "Greek Night",
        "venue": "The Flavor Hills",
        "address": "319 Fayetteville St",
        "startTime": "7:00 PM",
        "endTime": "10:00 PM",
        "latitude": 35.776075179180204,
        "longitude": -78.63910609335673,
        "details": "Calling all sorority and fraternity members! Join us every Thursday for a night celebrating Greek life with great food, drinks, and vibes.",
        "tags": ["Frats", "Food & Drink", "Party"]
    },
    {
        "date": "04/18/2024",
        "name": "Single Mingle",
        "venue": "Umbrella Dry Bar",
        "address": "14 W Martin St",
        "startTime": "7:00 PM",
        "endTime": "9:00 PM",
        "latitude": 35.77731260970505,
        "longitude": -78.63980565464585,
        "details": "Join us on Thursday, April 18, 2024, at 7:00 PM for the Shipp Dating Mixer! Are you tired of swiping left and right? Looking for a fun and exciting way to meet new people? Then this event is for you! This event is for singles between ages 25-35! Unlike other dating mixers, this will be focused on using our new dating app for any singles no matter your age! Currently only supported on iOS, if you do not have an iPhone we are working on an android version.",
        "tags": ["Couples", "Games", "Youth"]
    },
    {
        "date": "04/18/2024",
        "name": "A Thousand Heroes",
        "venue": "The Pour House Music Hall & Record Shop",
        "address": "224 S Blount St",
        "startTime": "8:00 PM",
        "endTime": "11:00 PM",
        "latitude": 35.77724316153944,
        "longitude": -78.63688040172335,
        "details": "None",
        "tags": ["Concert", "Rock Band", "Country"]
    },
    {
        "date": "04/18/2024",
        "name": "Zingara",
        "venue": "Lincoln Theatre",
        "address": "126 E Cabarrus St",
        "startTime": "9:30 PM",
        "endTime": "11:00 PM",
        "latitude": 35.77416840300173,
        "longitude": -78.63742625363479,
        "details": "None",
        "tags": ["Concert", "EDM", "Tour"]
    },
    {
        "date": "04/19/2024",
        "name": "21Marbles: PARTYology",
        "venue": "Marbles Kids Museum",
        "address": "201 E Hargett St",
        "startTime": "6:30 PM",
        "endTime": "9:30 PM",
        "latitude": 35.77867325748408,
        "longitude": -78.63624534950239,
        "details": "21Marbles: PARTYology is back on Friday, April 19 from 6:30pm to 9:30pm at Marbles Kids Museum. Sip, create and play your way to become a certified PARTYologist. Enjoy laser tag, human foosball, take home crafts, a science-inspired drink, pizza and other games and refreshments. All attendees must be 21+, photo ID is required for entry. All proceeds benefit Marbles Kids Museum, a community non-profit.",
        "tags": ["Games", "Museum", "21+", "Drinks"]
    },
    {
        "date": "04/19/2024",
        "name": "Album Release Show",
        "venue": "Hartwell",
        "address": "620 W South St",
        "startTime": "5:00 PM",
        "endTime": "8:00 PM",
        "latitude": 35.77275438647524,
        "longitude": -78.64905462209347,
        "details": "Join us for the second FREE show in the 2024 Better Days Live Music Series in Downtown Raleigh! On April 19 , we'll host the third live music event at Hartwell Raleigh as part of the Better Days Live Music Series with music from M.B. Mulkey (Raleigh) and J Candeed (Raleigh). Come out and celebrate the 4th album release from J Candeed with M.B. Mulkey opening the night. Come early starting at 5pm for food and drinks from the Hartwell Bar, then get ready for music starting at 6pm.",
        "tags": ["Concert", "Food & Drink", "Bluegrass", "Folk Music"]
    },
    {
        "date": "04/19/2024",
        "name": "Friday Night Cocktails",
        "venue": "Haymaker",
        "address": "555 Fayetteville St",
        "startTime": "9:00 PM",
        "endTime": "1:00 AM",
        "latitude": 35.773508698303345,
        "longitude": -78.6390579356635,
        "details": "Check out Haymaker every Friday night for downtown vibes including a full cocktail bar offering and a wide range of hip hop/r&b/afrobeats from DJ Moeskino.",
        "tags": ["DJ", "Party", "Drinks", "Hip Hop"]
    },
    {
        "date": "04/19/2024",
        "name": "Slim's Downtown Live Music",
        "venue": "Slim's Downtown",
        "address": "227 S Wilmington St",
        "startTime": "8:30 PM",
        "endTime": "11:30 PM",
        "latitude": 35.77759049741458,
        "longitude": -78.63804982219277,
        "details": "Join the powerhouse vocalist, guitarist, singer, and songwriter, Mysti Mayhem, at Slims Raleigh Downtown April 19th 9:00pm. With over 20 years of performing MayHem sings a variety of covers and originals in a bluesy, soulful rendition. Slims is a historic & iconic Dive Bar in Downtown Raleigh celebrating 25 years of featuring musicians on stage in an intimate setting with a welcoming but industrial vibe.",
        "tags": ["Live Show", "Bar", "Blues", "Food & Drink"]
    },
    {
        "date": "04/19/2024",
        "name": "Killed the Cowboy Tour",
        "venue": "Red Hat Amphitheater",
        "address": "500 S McDowell St",
        "startTime": "8:00 PM",
        "endTime": "11:00 PM",
        "latitude": 35.774236330776056,
        "longitude": -78.64311958670567,
        "details": "None",
        "tags": ["Concert", "Tour", "Country"]
    },
    {
        "date": "04/19/2024",
        "name": "The Vegabonds",
        "venue": "Lincoln Theatre",
        "address": "126 E Cabarrus St",
        "startTime": "8:30 PM",
        "endTime": "10:00 PM",
        "latitude": 35.77395157097512,
        "longitude": -78.63745113432003,
        "details": "None",
        "tags": ["Concert", "Rock Band", "Party"]
    },
    {
        "date": "04/20/2024",
        "name": "Elevate & Create Herbal Smoke Blending",
        "venue": "The Self Care Marketplace",
        "address": "12 W Martin St",
        "startTime": "1:00 PM",
        "endTime": "3:00 PM",
        "latitude": 35.77716810103753,
        "longitude": -78.63966492550111,
        "details": "Elevate your smoke sesh with a personalized blend of herbs to help support you physically, mentally, and spiritually. This class will equip you with all of the tools and knowledge needed to elevate and create the perfect herbal smoke blend for you. Led by Viktoria Thompson, herbalist and owner of Dell’s Temple.",
        "tags": ["Wellness Event", "Herbal Creations", "Calm"]
    },
    {
        "date": "04/20/2024",
        "name": "SustainabiliDAY",
        "venue": "Marbles Kids Museum",
        "address": "201 E Hargett St",
        "startTime": "1:00 PM",
        "endTime": "4:00 PM",
        "latitude": 35.77867325748408,
        "longitude": -78.63624534950239,
        "details": "Celebrate Earth Day at Marbles Kids Museum during Marbles SustainabiliDAY! Team Marbles and community partners will deliver fun and playful activities that explore sustainable resources, practices and careers in our community. Learn how you can be a part of a brighter, greener future! This event is included with museum admission.",
        "tags": ["Games", "Museum", "Earth Day", "Community"]
    },
    {
        "date": "04/20/2024",
        "name": "Tar Heel TroubadoursMusic Series",
        "venue": "NC Museum of History",
        "address": "5 E Edenton St",
        "startTime": "6:30 PM",
        "endTime": "8:30 PM",
        "latitude": 35.78174938149739,
        "longitude": -78.638628945042,
        "details": "A quintet who cheerfully disregards every kind of one-dimensional label that might be attached to its music, Fireside Collective has been on a roll since emerging seven years ago from the fertile roots music scene of Asheville. In quick order, the progressive bluegrass group released its debut album, won the 2016 Band Contest at MerleFest, earned an International Bluegrass Music Association Momentum Band of the Year nomination, and embarked on an ambitious touring schedule that’s earned an enthusiastic reception from traditional bluegrass to wide-ranging, eclectic music festival audiences alike. Blending the characteristic interplay of bluegrass instrumentation and harmonies with strong original material and exuberant energy, Fireside Collective has drawn on folk, blues, funk, and a wide variety of bluegrass sounds to create a distinctive body of work that’s all its own. Each member—Joe Cicero (guitar), Alex Genova (banjo), Jesse Iaquinto (mandolin), Tommy Maher (resonator guitar), and Carson White (upright bass)—brings a strong, original voice to his instrument. The unique contributions of different lead and harmony vocalists complement the variety in the group’s many original songs. Tar Heel Troubadours is a celebration of Americana, roots, bluegrass, and traditional music performed by artists from or living and working in North Carolina. A music performance at the North Carolina Museum of History is unlike any other! You’ll enjoy an intimate experience with an artist in our 300-seat venue. Every seat in the house has a fantastic view, and the sound is exceptional. The evening is complete with merchandise available from the artist and a bar with a special beer from Fullsteam Brewery plus wine.",
        "tags": ["Concert", "Bluegrass", "Band", "Auditorium"]
    },
    {
        "date": "04/20/2024",
        "name": "The North Carolina 'Cuegrass Festival",
        "venue": "Fayetteville Street Venue",
        "address": "Fayetteville St",
        "startTime": "12:00 PM",
        "endTime": "10:00 PM",
        "latitude": 35.77431193285652,
        "longitude": -78.63943031246775,
        "details": "The Pit's 14th annual 'Cuegrass Festival returns to Fayetteville Street on Saturday, April 20. Get ready for a day of toe-tappin' bluegrass music, delicious barbecue from The Pit, and beer from R&D Brewing - all to support local children's charities. As always, the event is free to attend and all proceeds from the festival go to SAFEchild and the BSA Occoneechee Council.",
        "tags": ["Music Festival", "Blueglass", "Street Food & Drink", "Charity"]
    },
    {
        "date": "04/20/2024",
        "name": "420 Reggae Fest",
        "venue": "Lincoln Theatre",
        "address": "126 E Cabarrus St",
        "startTime": "7:00 PM",
        "endTime": "10:00 PM",
        "latitude": 35.77395157097512,
        "longitude": -78.63745113432003,
        "details": "Featuring: Kash'd Out, Sons of Paradise, Crucial Fiya, The Hourglass Kids and DJ Ras J",
        "tags": ["Music Festival", "Reggae", "Live Sound"]
    },
    {
        "date": "04/20/2024",
        "name": "Sai Sei Upcycle Brand Launch",
        "venue": "Crank Arm Brewing",
        "address": "319 W Davie St",
        "startTime": "5:00 PM",
        "endTime": "8:00 PM",
        "latitude": 35.77558534818749,
        "longitude": -78.64408640680642,
        "details": "Join us for an evening of cocktails curated to represent Sai Sei and explore our exclusive pop-up market, where you can meet Heather VanWagner, the visionary behind Sai Sei, and immerse yourself in the forefront of Raleigh's fashion revolution. Attendees will have the opportunity to immerse themselves in the local arts scene and meet the artists who helped inspire the Sai Sei brand throughout its journey. Featuring an interactive art installation where attendees can immerse themselves into the brand by taking part in painting a pair of jeans, symbolizing the event's unity. With local vendors.",
        "tags": ["Fashion", "Store Opening", "Cocktails"]
    },
    {
        "date": "04/20/2024",
        "name": "The Power of Place",
        "venue": "Artspace",
        "address": "201 E Davie St",
        "startTime": "1:00 PM",
        "endTime": "4:00 PM",
        "latitude": 35.77579055260482,
        "longitude": -78.63628193251935,
        "details": "Create a meaningful collage that honors a place near and dear to you. You’ll explore the process of creating landscapes using photos, magazine images and decorative papers, then build upon it using paint and materials. Pulling from the instructor’s large collection of images, you can create a piece that is full of surprising details, dynamic shapes and symbols. All materials will be provided for this class, but you are still encouraged to bring your own images to include if you know what special place you would like to focus on. Artspace, your host for this event, is a non-profit visual arts center located in downtown Raleigh. Visit Artspace for a multitude of exhibitions featuring national and local artists and to enjoy a community of more than 35 artists working in studio, artists in residence and to find other art classes for all ages and abilities.",
        "tags": ["Arts & Crafts", "Families", "Casual"]
    },
    {
        "date": "04/21/2024",
        "name": "April Rooftop Brunch",
        "venue": "The Willard Rooftop Lounge",
        "address": "9 Glenwood Ave",
        "startTime": "11:00 AM",
        "endTime": "3:00 PM",
        "latitude": 35.781335133502765,
        "longitude": -78.64777353968122,
        "details": "Join us on Sunday, April 21, for an à la carte rooftop brunch served from 11am-3pm. The menu will feature brunch favorites with a Willard spin, like Eggs Benedict, Steak and Eggs, and a Crab Cake Sandwich. We’ll have live musical entertainment during brunch and the full Willard bar will be available so you can pair drinks with your meal. See the full brunch at the link below and make your reservation today.",
        "tags": ["Food & Drink", "Lunch Event", "Bar"]
    },
    {
        "date": "04/21/2024",
        "name": "Cassettes & Cognacs",
        "venue": "House of Art",
        "address": "306 E Hargett St",
        "startTime": "4:00 PM",
        "endTime": "8:00 PM",
        "latitude": 35.77797605825855,
        "longitude": -78.63460624189413,
        "details": "Come join us for an evening of cold drinks, good people and better vibes at the House of Art on Sun., April 21 starting at 4pm. Get ready to hang out with the DTRMG family while sipping on smooth drinks with friends and fellow music enthusiasts. Immerse yourself in a unique atmosphere where vintage meets elegance, as we celebrate the beauty of music and fine spirits. Whether you're in corporate or an entrepreneur, this event is perfect for anyone looking to unwind and enjoy good company. Don't miss out on this one-of-a-kind experience. Grab your tickets now and get ready for a event to remember!",
        "tags": ["Drinks", "Contemporary Art", "Elegant"]
    },
    {
        "date": "04/21/2024",
        "name": "Safari Room",
        "venue": "The Pour House Music Hall & Record Shop",
        "address": "224 S Blount St",
        "startTime": "7:00 PM",
        "endTime": "10:00 PM",
        "latitude": 35.77720689049962,
        "longitude": -78.63688388495945,
        "details": "With Max Gowan and Chris Larkin",
        "tags": ["Concert", "Indie Rock Band"]
    },
    {
        "date": "04/21/2024",
        "name": "The Girl of the Golden West",
        "venue": "Martin Marietta Performing Arts Center",
        "address": "2 E South St",
        "startTime": "1:00 PM",
        "endTime": "5:00 PM",
        "latitude": 35.77146901774059,
        "longitude": -78.6396024356792,
        "details": "The Gold Rush is on and the rules are off in Puccini’s wild west opera. Minnie’s saloon is the one place in town where the lawless gold seekers settle down and put their differences aside. But all that changes when a stranger rides into town and steals Minnie’s heart.",
        "tags": ["Concert", "Opera", "Classical"]
    }
]