[
    {
        "date": "04/23/2024",
        "name": "Candles & Corks: Candle Making at Vita Vite Wine Bar",
        "venue": "Vita Vite",
        "address": "313 W Hargett St",
        "startTime": "6:00 PM",
        "endTime": "8:00 PM",
        "latitude": 35.778600977779604,
        "longitude": -78.64428355767133,
        "details": "Candles & Corks is BACK! Join us on April 14th for Candles & Corks: a DIY candle making workshop at Vita Vite Art Gallery + Wine Bar!Hosted in the heart of Downtown Raleigh, Candles & Corks is a one-of-a-kind event at one of the most dynamic venues in the city. Start the night with a glass of bubbly when you check in, then pick your seats in Vita Vite’s Art Gallery. During the event, you'll go step-by-step to learn about all of the materials you need to make a candle and the candle making process. With the help of Usu Company Candles owner and Scent Designer, Stacy Ahua, you'll get to sample, select and blend a one-of-a-kind scent for your candle.  Plus, you’ll learn the story behind how Usu Company came to life and the inspiration behind the unique candles & stories behind the brand. At the end of the night, you'll leave with your own unique creation to enjoy at home! *As a bonus, your ticket includes complimentary community-style wine (a variety of red, white, and bubbly) & small bites to enjoy during the class!Tickets include: *1 luxury candle vessel*Complimentary Wine (community style)*Complimentary small bites*Materials to make your candle (100% Vegan Soy wax, wick, etc.)*Fragrance bar with up to 6 chemical-free fragrance oils to test and blend*Shop for Usu Co. candles to take home*Usu Company Gift Bag*Discount on future candle making workshops!"
    },
    {
        "date": "04/23/2024",
        "name": "Rabbit Hole Whiskey Tasting",
        "venue": "The Merchant",
        "address": "126 S Salisbury St.",
        "startTime": "6:00 PM",
        "endTime": "9:00 PM",
        "latitude": 35.77880813818195,
        "longitude": -78.64048218650697,
        "details": "The Rabbit Hole Distillery team guides you through an educational whiskey tasting experience that will be paired with an exquisite 4-course menu from The Merchant culinary team. Must be 21+ONE SEATING AT 6PM AND GOING TO 9PM (parties of 8 people or less)$115 + 20% gratuity + TaxThe menu for the evening:1st: Cavehill paired with lemon and maple soy Cavehill bourbon glazed bacon wrapped scallops2nd: Heigold paired with a southern braised pulled pork slider and crisp apple slaw3rd: Boxergrail paired with garlic and herb lamb chops and tricolor caramelized carrots4th: Derringer paired with a sherry cherry pie and vanilla bean ice creamEat, Drink, Vibe, and Enjoy, We are selling tickets on Event Brite and as well as Tock our website event URL"
    },
    {
        "date": "04/23/2024",
        "name": "Tasting Tuesday: Mixology Class",
        "venue": "Umbrella Dry Bar",
        "address": "14 W Martin St",
        "startTime": "5:30 PM",
        "endTime": "7:30 PM",
        "latitude": 35.77735305869859,
        "longitude": -78.63986158650697,
        "details": "Get hands-on: Learn the basics of bartending and craft your own delicious cocktails.Master the essentials: You'll be guided through essential bar tools and techniques, equipping you to impress your friends and family.Cocktails aplenty: You'll learn to make (and sip on!) a classic Daiquiri and two signature Umbrella cocktails Take home the tools: Discounted retail products will be available for purchase after the class, allowing you to recreate your favorites at home.Included: 3 full-sized cocktails, instruction, bar technique training, keepsake recipe card, 15% discount on retail products featured during the event. You will receive a recipe card containing the cocktail recipesDrink #1: Classic zero-proof daiquiriDrink #2: Kirbys dreamlandDrink #3: Leo sourTwo hours. Tickets $59."
    },
    {
        "date": "04/24/2024",
        "name": "Game Night!",
        "venue": "Umbrella Dry Bar",
        "address": "14 W Martin St",
        "startTime": "5:00 PM",
        "endTime": "8:00 PM",
        "latitude": 35.77735305869859,
        "longitude": -78.63986158650697,
        "details": "Get ready to shake up your game night routine with Umbrella – the ultimate destination for non-alcoholic cocktails and good times! Join us for an unforgettable evening filled with laughter, competition, and delicious drinks.We’ll have something for everyone to enjoy - from classics like Scattegories and Mancala, letter games like Bananagrams and Wordle, to drawing games like Telestrations.Make sure to get in on our Wine Bottle Wednesday happy hour - where we have bottles of (non-alcoholic) wine available to savor at the bar. Whether you're a seasoned gamer or just looking for a fun night out, our game night at Umbrella promises to be an evening to remember. So gather your friends, shake the dice, and let the good times roll!"
    },
    {
        "date": "04/24/2024",
        "name": "Jazz *Jam Session*",
        "venue": "Umbrella Dry Bar",
        "address": "14 W Martin St",
        "startTime": "7:00 PM",
        "endTime": "9:00 PM",
        "latitude": 35.77735305869859,
        "longitude": -78.63986158650697,
        "details": "Umbrella is hosting a jazz jam session with the Gregg Gelb Trio. Love playing music with instruments such as saxophones, trumpets, etc and looking for an excuse to play? Join Gregg Gelb on sax and two other players on bass and drums. The trio will ask players in the audience if they want to join the band for a tune or two.If you are a drummer or a bass player in the audience, you may replace the original member on the tune.The original trio will start the night with a few tunes before inviting the audience in.This is such a fun and immersive experience for listeners to hear from a variety of players."
    },
    {
        "date": "04/24/2024",
        "name": "WALTER's Book Club with Kristy Woodson Harvey",
        "venue": "City Club Raleigh",
        "address": "150 Fayetteville St",
        "startTime": "6:00 PM",
        "endTime": "9:00 PM",
        "latitude": 35.779188057652526,
        "longitude": -78.63963850192634,
        "details": "Join WALTER at City Club Raleigh as we host Kristy Woodson Harvey, a New York Times bestselling author of eleven novels, including The Summer of Songbirds, Under the Southern Sky and The Peachtree Bluff Series. Over summer supper and drinks, she'll share a preview of her newest book A Happier Life, which explores the power of family, the bonds of friendship, and the boundless nature of love. Your ticket includes cocktail hour, dinner, a book talk and signing opportunity with Kristy Woodson Harvey, plus a pre-ordered copy of A Happier Life. Copies of her book will be mailed out in late June when the book is released. Please make sure your mailing address is correct! The perfect Mother's Day gift! Harvey's past works will be available for purchase at the event as well."
    },
    {
        "date": "04/24/2024",
        "name": "Weaving Wednesdays",
        "venue": "North Carolina Museum of History",
        "address": "5 E Edenton St",
        "startTime": "10:00 AM",
        "endTime": "12:00 PM",
        "latitude": 35.782027646530295,
        "longitude": -78.63858958481323,
        "details": "Do you know your “warp” from your “weft?” Watch experts practice the craft of handweaving and spinning at the North Carolina Museum of History. Listen to their stories and talk with them about their works in progress.Craftspeople will be demonstrating most Wednesdays from 10 a.m. to noon."
    },
    {
        "date": "04/24/2024",
        "name": "Stargazing at The Willard",
        "venue": "The Willard Rooftop Lounge",
        "address": "9 Glenwood Ave",
        "startTime": "8:00 PM",
        "endTime": "10:00 PM",
        "latitude": 35.781468231920414,
        "longitude": -78.64778882883566,
        "details": "Join us on Wednesday, April 24, from 8-10pm for stargazing at The Willard along with our friends from Raleigh Astronomy Club! You’ll get to enjoy spectacular views of the moon and the starry night sky while you sip celestial-inspired cocktails on the rooftop.RAC will have telescopes and hobby astronomers on hand to guide your stargazing and answer questions, and The Willard’s full menu of small plates and handcrafted cocktails will be available for you to enjoy while you take in the skies and get cozy around our dual-sided fireplace.This event is free and open to the public. All are welcome."
    },
    {
        "date": "04/25/2024",
        "name": "Longleaf Selects: Coachella",
        "venue": "Longleaf Hotel",
        "address": "300 N Dawson St",
        "startTime": "6:00 PM",
        "endTime": "9:00 PM",
        "latitude": 35.78468845609897,
        "longitude": -78.64246927301396,
        "details": "In case you didn't make it to the desert, April's Longleaf Selects will feature artists from this month's Coachella lineup paired back to some cool California wines. Rain or shine, no cover."
    },
    {
        "date": "04/25/2024",
        "name": "Music on the Lawn ft. Counterclockwise String Band",
        "venue": "Heights House Hotel",
        "address": "308 S Boylan Ave",
        "startTime": "5:00 PM",
        "endTime": "9:00 PM",
        "latitude": 35.77681254720973,
        "longitude": -78.65108182883566,
        "details": "Come and experience live music on the lawn this Fall! Bring your blankets and chairs to the Heights House lawn from 5-8 pm to enjoy live music, drinks from the parlor, food trucks, lawn games, family friendly activities and more! You won't want to miss these family-friendly evenings.Counterclockwise String BandFood Trucks: Santopietros Sandwiches, Lao Lao Food Truck, Raleigh Popsicle Co.DETAILS:- Reservations open 30 days prior to each date- Bring your own blankets and/or chairs - No outside alcohol or pets permitted- Check in at front gate begins at 5pm- Only overnight hotel guests allowed indoors."
    },
    {
        "date": "04/25/2024",
        "name": "Spicy Book Club: Story of O",
        "venue": "Umbrella Dry Bar",
        "address": "14 W Martin St",
        "startTime": "7:00 PM",
        "endTime": "8:30 PM",
        "latitude": 35.77735305869859,
        "longitude": -78.63986158650697,
        "details": "Apparently, our Umbrella fam has a shared love of smutty books and pretty drinks. And we are here for it!How spicy are these books, you ask? Feral, crawling up the wall with anticipation spicy. Eroticism.The first book we’ll discuss is The Story of O, by Pauline ReageThe classic French erotic bestseller that preceded Fifty Shades of Grey. A beautiful young French woman, known only as 'O', is taken by her lover Ren to a splendid mansion near Paris. Here, she is initiated into an elite secret society, where she must learn to serve the sexual fantasies of Ren and his fellow members. But she must also explore the nature of her own darkest desires - and confront just how far she is willing to go for love.Below is a collection of notes about the book:-Story of O is a tale of female submission involving a beautiful Parisian fashion photographer named O, who is taught to be constantly available for sexual intercourse, offering herself to any male who belongs to the same secret society as her lover.-Through O's sexual exploits, the narrative explores themes related to gender norms and binaries, the role of clothing in identity, and humiliation as it relates to the social self.-In the early twenty-first century, many readers see The Story of O as a manifesto of a woman's right to erotic expression and self-determination, with O's sexual awakening, however tragic its outcome, seen as a kind of transcendence."
    },
    {
        "date": "04/25/2024",
        "name": "Stroll + Sparkle with Kenda Kist",
        "venue": "The Wine Feed",
        "address": "602 Glenwood Ave",
        "startTime": "7:15 PM",
        "endTime": "8:45 PM",
        "latitude": 35.78769501726175,
        "longitude": -78.64705082883565,
        "details": "Not all that sparkles is gold... sometimes it's wine!Treat yourself to an evening of super fun and friendly wines and a jewelry-making demonstration with local designer and artist, Kenda Kistenmacher! We'll kick things off with some bubbles while Kenda shares a little bit more about herself and the business of artisan jewelry-making before we take a 5 minute walk over to her studio, where she will provide a demonstration of one type of jewelry-making - and of course, and we'll enjoy some more wine too!Having recently celebrated 15 years (!) in business, Kenda Kist Jewelry holds impeccably high standards. All pieces are hand-crafted from the finest gemstones and precious metals available, all sourced responsible and combined artfully.This woman-owned brand continues to grow, and she is proud to continue to offer more and more job opportunities for fellow artisans in our community as the jewelry line increases. Your ticket includes not only this evening's wine, tour and demonstration, but also a hand-stamped bracelet with the city of Raleigh's coordinates and a bottle of wine to take home.Space is limited so reserve your spot today!"
    },
    {
        "date": "04/25/2024",
        "name": "Bikes & Brews",
        "venue": "Smoky Hollow",
        "address": "421 N Harrington St",
        "startTime": "11:00 AM",
        "endTime": "1:00 PM",
        "latitude": 35.78680101613603,
        "longitude": -78.64485234238151,
        "details": "Join Downtown Raleigh Alliance, Oak City Cycling Project, GoRaleigh and Oaks and Spokes for a morning of community and fun to kick off Bike Month in style. Complimentary bike check-ups (air in tires, oiled chain, etc.) are provided for all participants along with sweet treats and coffee from some of your favorite local DTR spots."
    },
    {
        "date": "04/26/2024",
        "name": "Brewgaloo",
        "venue": "Fayetteville Street Venue",
        "address": "443 Fayetteville St",
        "startTime": "6:00 PM",
        "endTime": "10:00 PM",
        "latitude": 35.7743741486228,
        "longitude": -78.63917587124307,
        "details": "Brewgaloo\r\n is a 2 day festival featuring over 110 craft breweries from around NC \r\nand partnering with local food trucks, local vendors, and local bands to\r\n bring you North Carolina’s largest craft beer festival!The fun begins Friday night with\r\n a sampler event from 6-10 PM featuring limited releases, barrel aged, \r\nand sour beers. Friday’s kick-off party is the perfect start to the \r\nweekend and a great way to get a taste of Brewgaloo.Saturday’s street festival spans the length of Fayetteville Street and fills Downtown Raleigh from\r\n 12-8 PM with more than 110 NC craft breweries, local food trucks, and \r\nlocal vendors. With 2 stages featuring local bands all day long this \r\nlively festival is sure to be a good time."
    },
    {
        "date": "04/27/2024",
        "name": "Brewgaloo",
        "venue": "Fayetteville Street Venue",
        "address": "443 Fayetteville St",
        "startTime": "12:00 PM",
        "endTime": "8:00 PM",
        "latitude": 35.7743741486228,
        "longitude": -78.63917587124307,
        "details": "Brewgaloo\r\n is a 2 day festival featuring over 110 craft breweries from around NC \r\nand partnering with local food trucks, local vendors, and local bands to\r\n bring you North Carolina’s largest craft beer festival!The fun begins Friday night with\r\n a sampler event from 6-10 PM featuring limited releases, barrel aged, \r\nand sour beers. Friday’s kick-off party is the perfect start to the \r\nweekend and a great way to get a taste of Brewgaloo.Saturday’s street festival spans the length of Fayetteville Street and fills Downtown Raleigh from\r\n 12-8 PM with more than 110 NC craft breweries, local food trucks, and \r\nlocal vendors. With 2 stages featuring local bands all day long this \r\nlively festival is sure to be a good time."
    },
    {
        "date": "04/26/2024",
        "name": "Mordecai Heirloom Plant Sale",
        "venue": "Mordecai Historic Park",
        "address": "1 Mimosa St",
        "startTime": "8:30 AM",
        "endTime": "2:00 PM",
        "latitude": 35.792883886160915,
        "longitude": -78.63328576900523,
        "details": "Celebrate Earth Day at Mordecai Historic Park and get your herb, vegetable, and flower gardens started for the season! Heirloom varieties of plants will be on sale for great prices. All plants are started from seed by the Mordecai Historic Park gardeners. Plants will include tomatoes, peppers, squash, herbs, and much more. Gardeners will be on hand to answer questions and provide more information about the garden and grounds at Mordecai Historic Park!The sale will be on Friday and Saturday, April 26-27 from 8:30 a.m. to 2 p.m. at the Mordecai Visitor Center. For questions or more information, please call 919-996-4364."
    },
    {
        "date": "04/27/2024",
        "name": "Mordecai Heirloom Plant Sale",
        "venue": "Mordecai Historic Park",
        "address": "1 Mimosa St",
        "startTime": "8:30 AM",
        "endTime": "2:00 PM",
        "latitude": 35.792883886160915,
        "longitude": -78.63328576900523,
        "details": "Celebrate Earth Day at Mordecai Historic Park and get your herb, vegetable, and flower gardens started for the season! Heirloom varieties of plants will be on sale for great prices. All plants are started from seed by the Mordecai Historic Park gardeners. Plants will include tomatoes, peppers, squash, herbs, and much more. Gardeners will be on hand to answer questions and provide more information about the garden and grounds at Mordecai Historic Park!The sale will be on Friday and Saturday, April 26-27 from 8:30 a.m. to 2 p.m. at the Mordecai Visitor Center. For questions or more information, please call 919-996-4364."
    },
    {
        "date": "04/26/2024",
        "name": "Pop Art Paint Your Pet",
        "venue": "Wine & Design",
        "address": "510 W Martin St",
        "startTime": "6:30 PM",
        "endTime": "8:30 PM",
        "latitude": 35.77759916545249,
        "longitude": -78.64734344242225,
        "details": "Get Your Art Buzz On at Wine & Design! No artistic talent needed, just the desire to have fun! We take the time to guide you step by step to complete your very own take home masterpiece of your furry friend!Please email raleigh@wineanddesign.com with a high resolution photo of your pet by AT LEAST 5 days prior to this event! Headshots are best. One pet per photo please."
    },
    {
        "date": "04/27/2024",
        "name": "A Place At The Mat - Fundraiser for A Place At the Table w. Twine Yoga",
        "venue": "The Self Care Marketplace",
        "address": "12 W Martin St",
        "startTime": "10:00 AM",
        "endTime": "11:00 AM",
        "latitude": 35.77746639169108,
        "longitude": -78.63970631545537,
        "details": "Please join Twine Yoga and The Self Care Marketplace in a fun-filled morning with an invigorating yummy yoga practice followed by intoxicating sensory shopping delights to raise funds for this important cause!"
    },
    {
        "date": "04/27/2024",
        "name": "Cocktails & Cuisine Class: All Things Gin",
        "venue": "The Willard Rooftop Lounge",
        "address": "9 Glenwood Ave",
        "startTime": "2:00 PM",
        "endTime": "3:30 PM",
        "latitude": 35.781468231920414,
        "longitude": -78.64778882883566,
        "details": "Get inspired to up your cocktail game at home as you gather around the bar at The Willard Rooftop for our gin-themed Cocktails & Cuisine Class on Saturday, April 13 or 27.Two of our skilled bartenders, Jess and Parker, will demonstrate how to make three delicious gin-based cocktails and then you’ll get to enjoy the fruits of your labor paired with food from our very own Chef Kyle Teears all while you take in the spectacular views from The Willard Rooftop.Class sizes are limited so purchase tickets now for $55 per person. We are unable to accommodate dietary restrictions at this event."
    },
    {
        "date": "04/27/2024",
        "name": "Dueling Dinosaurs Grand Opening",
        "venue": "NC Museum of Natural Sciences and Nature Research Center",
        "address": "11 W Jones St",
        "startTime": "10:00 AM",
        "endTime": "5:00 PM",
        "latitude": 35.78258228138095,
        "longitude": -78.63929268479801,
        "details": "Celebrate the Grand Opening of Dueling Dinosaurs — an exciting new exhibit that will forever change how we view the world’s two favorite dinosaurs — the tyrannosaur and the Triceratops.Enter the world of a paleontologist where you’ll see dinosaur fossils still encased in the sediment that buried them. Watch scientists in their lab as they uncover, grain by grain, the dinosaurs that lie beneath. Talk to the research team as they work to piece together this mystery. Join us on a thrilling journey of scientific exploration, 67 million years in the making.Please note: This Grand Opening is FREE and open to the public. No ticket is required for entry to the Dueling Dinosaurs exhibit on this day only. Guests will be admitted first come, first served.Become a Member! Get an exclusive invitation to Dueling Dinosaurs Friends & Family Day, plus enjoy free, unlimited admission to special exhibitions, discounts in Museum Stores & Cafés and more. Join today: ncmns.net/JoinNCMNS"
    },
    {
        "date": "04/27/2024",
        "name": "Silent Book Club",
        "venue": "Umbrella Dry Bar",
        "address": "14 W Martin St",
        "startTime": "11:15 AM",
        "endTime": "1:00 PM",
        "latitude": 35.77735305869859,
        "longitude": -78.63986158650697,
        "details": "Hang at Umbrella and read a book! Yes, whatever book you’d like. Read silently for an hour (11:15-12:15), and then stay to chat if that sounds interesting to you. Share thoughts from the book you’re reading, or hear what others are reading about. Or peace out after reading time - up to you. This is a low-pressure event. Some may refer to this as “introvert unite”, and some may simply see it as an excuse to be in a different environment for reading. We love the cozy atmosphere and are excited to welcome you in to silently read, together in community. A non-alcoholic espresso martini in the lounge, reading whatever fits your fancy? No need to prepare questions, snacks, or tidy up the house? Casual chit-chat around books and love of reading? Yes, please.Joy, comfort, camaraderie, accessibility, books without homework, pretty NA drinks. That’s the intention behind this series. Try it out.The bar opens at 11 on Saturday morning, hence the 11:15 “start” time - providing you an opportunity to settle in while still getting a dedicated hour to reading. 45 minutes of unstructured interaction and discussion afterwards if you’d like."
    },
    {
        "date": "04/28/2024",
        "name": "ANTFARM 30TH ANNIVERSARY CELEBRATION",
        "venue": "Rebus Works",
        "address": "301 Kinsey St",
        "startTime": "4:00 PM",
        "endTime": "7:00 PM",
        "latitude": 35.77710911643658,
        "longitude": -78.64964824238551,
        "details": "raleigh’s oldest arts co-op is three decades old and we’re hosting a party!- meet our artists- connect with alumni and former community members- tour antfarm- enjoy the historic warehouse district- view current member JAY CAMPBELL’S paintings, which will be on exhibit through April- help us upfit our space and revive this community with a $20 suggested donation, fine art poster sales, or tshirt salesif you don’t purchase a $20 presale ticket for the event, we will be accepting donations at the door; you can join the celebration without a ticket"
    },
    {
        "date": "04/28/2024",
        "name": "Rooftop Yoga at The Willard",
        "venue": "The Willard Rooftop Lounge",
        "address": "9 Glenwood Ave",
        "startTime": "10:00 AM",
        "endTime": "12:00 PM",
        "latitude": 35.781468231920414,
        "longitude": -78.64778882883566,
        "details": "Join Oak City Yoga for rooftop yoga with unmatched views of downtown Raleigh from the outdoor rooftop terrace at The Willard on Sunday, April 28, at 10am. Registration required; includes a mimosa from our bar."
    },
    {
        "date": "04/27/2024",
        "name": "The 35th Annual Oakwood Garden Tour",
        "venue": "Tucker House - Historic Oakwood",
        "address": "418 North Person St",
        "startTime": "10:00 AM",
        "endTime": "2:00 PM",
        "latitude": 35.78549533258237,
        "longitude": -78.63415594239348,
        "details": "The Oakwood Garden Club is excited to continue the 35th annual Oakwood Garden Tour and this year’s pollinator-themed Fascinator & Boutonniere Making Experience.On Saturday, April 27th, and Sunday, April 28th, guests will enjoy a self-guided walking tour featuring Historic Oakwood’s fabulous gardens. Please be prepared to walk approximately 1.5 miles and wear appropriate footwear. Garden hats are always encouraged!We can’t have an Oakwood Garden Tour without confections! Iced tea will be served during the walking tour in select gardens along with a few sweet and savory treats from local businesses.This year's add-on Fascinator/Boutonniere Making Experience is pollinator themed and we can't wait to celebrate these amazing insects and plants by making one-of-a-kind headpieces and debonair boutonnieres!"
    },
    {
        "date": "04/28/2024",
        "name": "The 35th Annual Oakwood Garden Tour",
        "venue": "Tucker House - Historic Oakwood",
        "address": "418 North Person St",
        "startTime": "10:00 AM",
        "endTime": "2:00 PM",
        "latitude": 35.78549533258237,
        "longitude": -78.63415594239348,
        "details": "The Oakwood Garden Club is excited to continue the 35th annual Oakwood Garden Tour and this year’s pollinator-themed Fascinator & Boutonniere Making Experience.On Saturday, April 27th, and Sunday, April 28th, guests will enjoy a self-guided walking tour featuring Historic Oakwood’s fabulous gardens. Please be prepared to walk approximately 1.5 miles and wear appropriate footwear. Garden hats are always encouraged!We can’t have an Oakwood Garden Tour without confections! Iced tea will be served during the walking tour in select gardens along with a few sweet and savory treats from local businesses.This year's add-on Fascinator/Boutonniere Making Experience is pollinator themed and we can't wait to celebrate these amazing insects and plants by making one-of-a-kind headpieces and debonair boutonnieres!"
    },
    {
        "date": "04/29/2024",
        "name": "Reclaiming Running (6 Week Series)",
        "venue": "Current Wellness",
        "address": "219 S East St",
        "startTime": "6:30 PM",
        "endTime": "7:30 PM",
        "latitude": 35.77753327426417,
        "longitude": -78.63205236931472,
        "details": "Are you interested in running but don’t know where to begin? Maybe you’ve tried run clubs in the past but have felt intimidated or completely left behind by the pace groups. Or, maybe running has been connected to punishment or weight loss. Running doesn’t have to be like that! It’s time to start reclaiming running for you!In this six-week series, we will break down the barriers that make running feel inaccessible, covering the foundations of stretching and proper cross training, and will provide a fun and welcoming space for runners of all abilities to move at their own pace. This is a size-inclusive series that will focus on reclaiming running (and walking and jogging) to feel empowered in our bodies.Join us on Monday evenings at 6:30pm. We will begin with a warm-up and discussion, and then head outside for a walk/run. This is suited for people new to running, as well as folks who’s pace is more than 12 minutes/mile.Julia Carter leads Reclaiming Running – and she also offers 1:1 run coaching and teaches classes at the Current!This series runs from April 29th through June 3rd and meets right outside of Current Wellness.Cost: $120/6 weeksEarly Bird Special $95 – sign up before April 10th!"
    },
    {
        "date": "05/01/2024",
        "name": "Fat Positive Strength Crew (6 Week Series)",
        "venue": "Current Wellness",
        "address": "219 S East St",
        "startTime": "7:30 PM",
        "endTime": "8:30 PM",
        "latitude": 35.77753327426417,
        "longitude": -78.63205236931472,
        "details": "Introducing the “Fat Positive Strength Crew” – a 6-week strength training series designed to empower individuals in larger bodies and promote a positive relationship with fitness. We limit this small group training program to 8 participants to offer personalized attention. This series embraces the philosophy that strength comes in all shapes and sizes.Led by a fat positive personal trainer, Andrea Sutton, this series combines expert instruction with a nurturing community atmosphere. Participants will engage in a variety of dynamic and functional exercises tailored to their unique fitness levels and goals. From lifting weights to bodyweight movements, Andrea designs each workout to enhance overall strength, improve mobility, and increase confidence in one’s own body.Beyond the physical aspect, the “Fat Positive Strength Crew” fosters a supportive community. It creates a space where participants can connect, share experiences, and uplift one another. This series is an affinity group for people who identify as fat, plus-sized, or larger bodied. In order to make this space as safe as possible, please make sure you are a good fit before signing up.This group will meet on Wednesdays at 7:30pm from May 1st through June 5th.Cost: $240 for 6 weeks"
    },
    {
        "date": "05/01/2024",
        "name": "History at High Noon: John Chavis Memorial Park Carousel",
        "venue": "North Carolina Museum of History",
        "address": "5 E Edenton St",
        "startTime": "12:00 PM",
        "endTime": "1:00 PM",
        "latitude": 35.782027646530295,
        "longitude": -78.63858958481323,
        "details": "Join the North Carolina Museum of History as we welcome Dana Brown and Madison Phillips of John Chavis Memorial Park, as they give us the inside scoop on the beautiful, historical Allan Herschell carousel at Chavis Park, as well as how this space has served as a pillar of the downtown Raleigh African American community for decades! This is a hybrid program. An email containing the Zoom link will be sent to all registrants not attending in person an hour and a half before the program begins.Please join us in the Daniels Auditorium at the North Carolina Museum of History OR via Zoom. The Zoom link will be posted on the day of the program and sent out to all registrants."
    },
    {
        "date": "05/02/2024",
        "name": "History and Highballs: Still Starring North Carolina!",
        "venue": "North Carolina Museum of History",
        "address": "5 E Edenton St",
        "startTime": "7:00 PM",
        "endTime": "10:00 PM",
        "latitude": 35.782027646530295,
        "longitude": -78.63858958481323,
        "details": "Way back in 2014, the North Carolina Museum of History’s exhibit Starring North Carolina! explored the state’s more than 100-year history of filmmaking. The exhibit launched Longleaf Film Festival in 2015. Today, the exhibit is closed, but both Longleaf and the state’s many connections to filmmaking continue. Sure, you know about the North Carolina connection to Bull Durham (1988) and Dirty Dancing (1987), but what about The Heart of Esmeralda (1912) or Summer Camp (2024)? Of course, commercial film is the tip of the iceberg of what filmmaking means in the Tar Heel State. So why North Carolina, and how can you access the latest and greatest in North Carolina–related film action? Join Sally Causey Bloom, director of Longleaf Film Festival, to explore some of the history and ongoing contributions to cinema in our state and beyond!History and Highballs: Still Starring North Carolina!Thursday, May 2, 2024, 7 p.m., via Zoom.The Zoom link will be posted the day of the program and sent out to all registrants.Speaker: Sally Causey Bloom, Director, Longleaf Film Festival, North Carolina Museum of History"
    },
    {
        "date": "05/03/2024",
        "name": "First Friday: SPARK – Live Cello Reimagined",
        "venue": "Current Wellness",
        "address": "219 S East St",
        "startTime": "6:30 PM",
        "endTime": "7:30 PM",
        "latitude": 35.77753327426417,
        "longitude": -78.63205236931472,
        "details": "Join cellist Jean Gay as she guides you into and through an immersive musical experience designed to bring you in deep connection with the sounds of her live performance. Jean is passionate about presenting music in settings and ways that encourage those present to engage fully, to feel open to ask questions and explore different aspects of their experience, and to hold curiosity and empathy when exploring unfamiliar territory.For her performance at Current Wellness Jean will incorporate the following into the concert experience to facilitate deeper layers of listening and feeling: a guided body scan to open the program, ample opportunity for dialogue between pieces, simple instructions for a free-form group art piece to be created during a piece, and mad-lib inspired word sharing around another piece.This current program, SPARK, features works of five living composers, offering an opportunity to engage with current musical expression and imagination. Come ready to explore and experience these five pieces for solo cello in a new way, and to discover what the music inspires and awakens in you!More information about SPARK may be found at jgcello.com/spark. Attendance is limited to 16 people to allow for dialogue and full participation by all those present.SPARK composers & works:Jessica Meyer “Delta Sunrise” and “Swerve” (2017/16)Nathalie Joachim “Dam Mwen Yo” (2016)Martha Bishop “Desert Gloom, Desert Radiance” (2000, rev. 2016)Diajana Wallace “Shades” (2019)When: May 3rd 6:30-7:30pmCost: $35 (members get 20% off)"
    },
    {
        "date": "05/03/2024",
        "name": "First Order Friday | Star Wars Movie + Market",
        "venue": "Moore Square",
        "address": "200 S Blount St",
        "startTime": "5:00 PM",
        "endTime": "9:00 PM",
        "latitude": 35.77763445898027,
        "longitude": -78.63620632573331,
        "details": "Travel to a galaxy far, far away in the heart of Downtown Raleigh at First Order Friday! Programming + Activities —"
    },
    {
        "date": "05/03/2024",
        "name": "“Eyrie One” an exhibition of paintings by Scott Eagle",
        "venue": "City Market Artist Collective",
        "address": "300 Blake St",
        "startTime": "6:00 PM",
        "endTime": "10:00 PM",
        "latitude": 35.77623638009472,
        "longitude": -78.63603848486443,
        "details": "“ Eyrie one” an exhibition of paintings by Scott Eagle. Scott Eagle is an associate professor and Area Coordinator of Painting and Drawing at East Carolina University in Greenville, North Carolina. His artworks have been exhibited and reproduced internationally. Publications featuring his artwork include The Oxford American, The New York Times, the Cleveland Plains Dealer, Wired Magazine, and numerous books. Scott was selected by Creative Quarterly Magazine as one of their top 100 creatives for 2013 and a life-size reproduction of his ARTLab mural was displayed over the front door of the US Embassy in Beijing, China in 2021. He works in a wide variety of medias including digital and is especially interested in the idea of the creative act as thinking through making."
    },
    {
        "date": "05/03/2024",
        "name": "Best of North Carolina 2024",
        "venue": "Gallery C",
        "address": "540 N Blount St",
        "startTime": "6:00 PM",
        "endTime": "8:00 PM",
        "latitude": 35.78796962742654,
        "longitude": -78.63576600010474,
        "details": "Gallery owner, art historian, and North Carolina native Charlene Newsom employs her broad knowledge of NC art to curate an extensive collection celebrating the best and brightest NC artists of past and present.The show includes landmark pieces by influential North Carolina artists. Some of the biggest names and most important North Carolina art from the 20th century are included in this year’s show."
    },
    {
        "date": "05/03/2024",
        "name": "Jean Gray Mohs - \"Woven Strangers\"",
        "venue": "Arts Access Gallery",
        "address": "444 S Blount St",
        "startTime": "6:00 PM",
        "endTime": "9:00 PM",
        "latitude": 35.77583239972358,
        "longitude": -78.63700284242702,
        "details": "Arts Access North Carolina launches their new gallery with an exhibition of \"woven Strangers\" by artist Jean Gray Mohs.Contemporary artist Jean Gray Mohs, who focuses primarily on painting and sculpture, will be the first artist to display her work – a collection of dimensional acrylic paintings on wood – at the Arts Access Gallery. The “Woven Strangers” collection will be on display from March 1 through May 18 at 444 S. Blount Street, Suite 115B in Raleigh. Mohs, a North Carolina native who had a double lung transplant, often contrasts materials like maple plywood and waxed thread in her pieces which reflect the interplay of strength and fragility in the face of her chronic illness.“I’m honored to showcase 'Woven Strangers' at Arts Access, a beacon at the crossroads of arts, education, and disability. My pieces celebrate the beauty, delicate balance, and incredible resilience embodied in the journey of living with chronic illness and past disability.”Over her career, Mohs has presented her work in more than 20 solo shows, participated in 91 group exhibitions, and contributed to 24 museum and university exhibitions. Her art has graced prestigious venues, including the Contemporary Art Museum, Artspace, and Peel Gallery.The gallery marks a new chapter for Arts Access North Carolina, which is celebrating its 40th anniversary this year..  The new space shifts Arts Access from an organization that most people know as a partner that helps other arts organizations improve accessibility through audio descriptions, on-site assessments, and training to one that is also promoting inclusivity through this new immersive gallery experience. The gallery will host four shows throughout 2024. In addition to the spring gallery opening exhibition, there will be a show in summer, fall and winter. For more information about the gallery visit https://artsaccessinc.org/arts-access-gallery/"
    },
    {
        "date": "05/03/2024",
        "name": "Opening Night: Alex Stone with VISUALS Tasting",
        "venue": "Burial Beer Co. The Exhibit in Transfer Co. Food Hall",
        "address": "500 E Davie St",
        "startTime": "6:00 PM",
        "endTime": "8:00 PM",
        "latitude": 35.775485101452034,
        "longitude": -78.63214328478368,
        "details": "Celebrated every month in Downtown Raleigh, First Friday puts the best of our vibrant creative community on display. Roll through on Friday, 5/3 to browse our latest gallery by local artist Alex Stone and enjoy a VISUALS Tasting."
    },
    {
        "date": "05/04/2024",
        "name": "Alice and Wonderland and Balanchine's Who Cares? presented by Cary Ballet Company",
        "venue": "Martin Marietta Center for the Performing Arts",
        "address": "2 E South St",
        "startTime": "1:00 PM",
        "endTime": "3:00 PM",
        "latitude": 35.77161700081546,
        "longitude": -78.63962925780568,
        "details": "Be ready to be transported to a whimsical world with Jill Bahr’s captivating ballet interpretation of “Alice in Wonderland” and immersed in the timeless elegance of George Balanchine’s “Who Cares?”. Cary Ballet Company's dancers will bring these iconic works to life, showcasing the beauty, grace, and storytelling prowess that define the art of ballet. Don’t miss this spring dance showcase that promises to delight and inspire audiences of all ages."
    },
    {
        "date": "05/04/2024",
        "name": "Alice and Wonderland and Balanchine's Who Cares? presented by Cary Ballet Company",
        "venue": "Martin Marietta Center for the Performing Arts",
        "address": "2 E South St",
        "startTime": "6:00 PM",
        "endTime": "8:00 PM",
        "latitude": 35.77161700081546,
        "longitude": -78.63962925780568,
        "details": "Be ready to be transported to a whimsical world with Jill Bahr’s captivating ballet interpretation of “Alice in Wonderland” and immersed in the timeless elegance of George Balanchine’s “Who Cares?”. Cary Ballet Company's dancers will bring these iconic works to life, showcasing the beauty, grace, and storytelling prowess that define the art of ballet. Don’t miss this spring dance showcase that promises to delight and inspire audiences of all ages."
    },
    {
        "date": "05/04/2024",
        "name": "Bike Rodeo",
        "venue": "Marbles Kids Museum",
        "address": "201 E Hargett St",
        "startTime": "9:30 AM",
        "endTime": "12:00 PM",
        "latitude": 35.77869263433266,
        "longitude": -78.63626025775805,
        "details": "Bring your bike, trike and helmet and get rolling! Obstacle courses, bike safety, art on the move and bike bling. For all ages and skill levels. This is a free event taking place in the Marbles Courtyard. Museum Admission is NOT included."
    },
    {
        "date": "05/04/2024",
        "name": "Crêpes! Family Friendly Cooking",
        "venue": "Current Wellness",
        "address": "219 S East St",
        "startTime": "2:00 PM",
        "endTime": "4:00 PM",
        "latitude": 35.77753327426417,
        "longitude": -78.63205236931472,
        "details": "Join us in the kitchen for cooking adventures and crêpes! Whether you are looking to learn a new skill in time for Mother’s Day or just looking to make and eat some tasty treats, this class is for you – and your family!Rooted in the culinary traditions of France, Florence Melin will be your expert guide through the art of crafting delicious and versatile crepes. From perfecting the batter to exploring a diverse range of fillings, Florence brings her French expertise to ensure a tantalizing culinary adventure.We tailored this event for families and we invite you to join in the kitchen fun! Under Florence’s expert tutelage, participants of all ages will have the opportunity to unleash their creativity and practice their crepe-making skills. Florence will also demonstrate how to make a salted butter caramel!This class promises a scrumptious variety of sweet indulgences. Revel in the pleasure of creating mouthwatering treats with your family, surrounded by a community of crêpe enthusiasts.This crêpe cooking class is for all ages – bring your child, your teen, your friend, and your mother!Saturday, May 4th 2-4pmCost: $60 for an adult or $90 for an adult and a child (17 years and younger)"
    },
    {
        "date": "05/04/2024",
        "name": "Derby in the Den at Fox Liquor Bar",
        "venue": "Fox Liquor Bar",
        "address": "237 S Wilmington St",
        "startTime": "12:00 PM",
        "endTime": "2:00 PM",
        "latitude": 35.777233341892824,
        "longitude": -78.63804557124949,
        "details": "Celebrate the 150th Kentucky Derby with Fox Liquor Bar! Join us in your best derby attire for specialty cocktails, amazing bites, a raffle, and the race for Derby in the Den!"
    },
    {
        "date": "05/04/2024",
        "name": "Geek and Grub Night Market (May the 4th Be With You Edition)",
        "venue": "Fred Fletcher Park",
        "address": "820 Clay St",
        "startTime": "6:00 PM",
        "endTime": "10:00 PM",
        "latitude": 35.79312636324009,
        "longitude": -78.64909062574165,
        "details": "🚀 Journey to the Stars in Downtown Raleigh! 🚀Embark on a cosmic adventure at the Galactic Grub Market's special May the Fourth edition! Suit up in your most stellar space-themed costumes, channeling the spirit of legendary space warriors and interstellar explorers. Dive into an array of universal-themed competitions and activities.🌟 Command Center (Our HQ Booth) 🌟Young space cadets can snag a free celestial treat, while all explorers can discover our thrilling, FREE space scavenger hunt. If your journey through the stars leaves you parched, refresh at our Geek Tavern with a selection of galaxy-inspired, non-alcoholic beverages.🍔 Space Cantina (Food Trucks & Vendors) 🍔Refuel with out-of-this-world bites from our cosmic food trucks and vendors. Then, explore the galaxy of goods and unique items our interstellar merchants have brought for your perusal!📅 Celestial Event Schedule 📅Keep your eyes on the stars for upcoming updates! To join an activity, report to the Command Center (HQ desk) 10 minutes before launch.6:30pm: Young Cadets' Moon Egg Toss7:00pm: Raffle Draw #18:00pm: Adults' Galactic Blaster Challenge9:30pm: Spectacular Space Saber Performance by Sword Circle10:00pm: Raffle Draw #2🛸 Galactic FAQs: Your Guide Through the Cosmos 🛸Need a Launch Pass? No pass required for this stellar journey.Event Location? Fred Fletcher Park, 820 Clay Street, Downtown Raleigh.Spacecraft Parking? Utilize street parking (downtown logistics). Arrive early or park in a nearby garage and shuttle in.Cantina Offerings? A variety of intergalactic food vendors and trucks, plus our Geek Tavern with special galaxy-themed mocktails (alcohol-free zone).Raffle Mechanics? Receive a pair of raffle tickets with each vendor transaction. Submit at the Command Center for a chance to win cosmic prizes at 7pm and 10pm. Presence required for victory.Space Scavenger Hunt? A family-friendly mission through the market. Download our app on arrival and navigate through vendor booths for fun challenges. Complete the hunt for a chance to spin the prize wheel!Enlist as a Merchant? Apply for the 2024 season on our website.Gear up for a day where the love of all things cosmic and delicious treats collide under the starlit sky! Let the galactic celebrations begin!"
    },
    {
        "date": "05/05/2024",
        "name": "Curvy Yoga with Plus Raleigh",
        "venue": "Current Wellness",
        "address": "219 S East St",
        "startTime": "11:00 AM",
        "endTime": "12:00 PM",
        "latitude": 35.77753327426417,
        "longitude": -78.63205236931472,
        "details": "Are you interested in trying yoga, but don’t think it’s for you? Then our Curvy Yoga class in collaboration with Plus Raleigh is designed just for you!Curvy Yoga is a body affirming yoga centralized on creating a practice that is right for you and fostering self-kindness on and off the mat. The class is full of options so you can figure out what works best for your body. No yoga experience is required!Instructor: Angela GriffinWhen: May 5th at 11amDiscounted Drop-in Rate: $10"
    },
    {
        "date": "05/05/2024",
        "name": "Neptunes Comedy",
        "venue": "Neptunes Parlour",
        "address": "14 W Martin St",
        "startTime": "6:30 PM",
        "endTime": "9:30 PM",
        "latitude": 35.77735305869859,
        "longitude": -78.63986158650697,
        "details": "May the fifth be with you or whatever because we’ve got a HOT ONE with John-Michael Bond headlining Neptunes Comedy at Neptunes Parlour!"
    }
]